In [2]:
from tabula import read_pdf
df = read_pdf('/home/pankaj/Downloads/ADHAR CARD.pdf',java_options=True)

ModuleNotFoundError: No module named 'tabula'

In [5]:
pip install tabula-py

Collecting tabula-py
  Downloading https://files.pythonhosted.org/packages/b7/7e/9e7fff31bc80c300479a4c0bdd8e15298bf85f5a3fba05b2f7268f993456/tabula_py-2.0.4-py3-none-any.whl (10.4MB)
     |████████████████████████████████| 10.4MB 102kB/s eta 0:00:01
Requirement already satisfied: pandas in /home/pankaj/anaconda3/lib/python3.7/site-packages (from tabula-py) (0.25.1)
Requirement already satisfied: numpy in /home/pankaj/anaconda3/lib/python3.7/site-packages (from tabula-py) (1.17.2)
Collecting distro (from tabula-py)
  Downloading https://files.pythonhosted.org/packages/ea/35/82f79b92fa4d937146c660a6482cee4f3dfa1f97ff3d2a6f3ecba33e712e/distro-1.4.0-py2.py3-none-any.whl
Requirement already satisfied: pytz>=2017.2 in /home/pankaj/anaconda3/lib/python3.7/site-packages (from pandas->tabula-py) (2019.3)
Requirement already satisfied: python-dateutil>=2.6.1 in /home/pankaj/anaconda3/lib/python3.7/site-packages (from pandas->tabula-py) (2.8.0)
Requirement already satisfied: six>=1.5 in /home/pankaj/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas->tabula-py) (1.12.0)
Installing collected packages: distro, tabula-py
Successfully installed distro-1.4.0 tabula-py-2.0.4
Note: you may need to restart the kernel to use updated packages.

## pandas functions and methods

In [84]:
# pd.DataFrame(np.random.rand(20,5))	5 columns and 20 rows of random floats
# pd.Series(my_list)	Create a series from an iterable my_list
# df.index = pd.date_range('1900/1/30', periods=df.shape[0])	Add a date index
# Viewing/Inspecting Data

# df.head(n)	First n rows of the DataFrame
# df.tail(n)	Last n rows of the DataFrame
# df.shape	Number of rows and columns
# df.info()	Index, Datatype and Memory information
# df.describe()	Summary statistics for numerical columns
# s.value_counts(dropna=False)	View unique values and counts
# df.apply(pd.Series.value_counts)	Unique values and counts for all columns
# Selection

# df[col]	Returns column with label col as Series
# df[[col1, col2]]	Returns columns as a new DataFrame
# s.iloc[0]	Selection by position
# s.loc['index_one']	Selection by index
# df.iloc[0,:]	First row
# df.iloc[0,0]	First element of first column
# Data Cleaning

# df.columns = ['a','b','c']	Rename columns
# pd.isnull()	Checks for null Values, Returns Boolean Arrray
# pd.notnull()	Opposite of pd.isnull()
# df.dropna()	Drop all rows that contain null values
# df.dropna(axis=1)	Drop all columns that contain null values
# df.dropna(axis=1,thresh=n)	Drop all rows have have less than n non null values
# df.fillna(x)	Replace all null values with x
# s.fillna(s.mean())	Replace all null values with the mean
# s.astype(float)	Convert the datatype of the series to float
# s.replace(1,'one')	Replace all values equal to 1 with 'one'
# s.replace([2,3],['two', 'three'])	Replace all 2 with 'two' and 3 with 'three'
# df.rename(columns=lambda x: x + 1)	Mass renaming of columns
# df.rename(columns={'old_name': 'new_ name'})	Selective renaming
# df.set_index('column_one')	Change the index
# df.rename(index=lambda x: x + 1)	Mass renaming of index
# Filter, Sort, and Groupby

# df[df[col] > 0.6]	Rows where the column col is greater than 0.6
# df[(df[col] > 0.6) & (df[col] < 0.8)]	Rows where 0.8 > col > 0.6
# df.sort_values(col1)	Sort values by col1 in ascending order
# df.sort_values(col2,ascending=False)	Sort values by col2 in descending order.5
# df.sort_values([col1,col2],ascending=[True,False])	Sort values by col1 in ascending order then col2 in descending order
# df.groupby(col)	Returns a groupby object for values from one column
# df.groupby([col1,col2])	Returns groupby object for values from multiple columns
# df.groupby(col1)[col2]	Returns the mean of the values in col2, grouped by the values in col1
# df.pivot_table(index=col1,values=[col2,col3],aggfunc=mean)	Create a pivot table that groups by col1 and calculates the mean of col2 and col3
# df.groupby(col1).agg(np.mean)	Find the average across all columns for every unique col1 group
# df.apply(np.mean)	Apply the function np.mean() across each column
# nf.apply(np.max,axis=1)	Apply the function np.max() across each row
# Join/Combine

# df1.append(df2)	Add the rows in df1 to the end of df2 (columns should be identical)
# pd.concat([df1, df2],axis=1)	Add the columns in df1 to the end of df2 (rows should be identical)
# df1.join(df2,on=col1, how='inner')	SQL-style join the columns in df1 with the columns on df2 where the rows for col have identical values. The 'how' can be 'left', 'right', 'outer' or 'inner'
# Statistics

# df.describe()	Summary statistics for numerical columns
# df.mean()	Returns the mean of all columns
# df.corr()	Returns the correlation between columns in a DataFrame
# df.count()	Returns the number of non-null values in each DataFrame column
# df.max()	Returns the highest value in each column
# df.min()	Returns the lowest value in each column
# df.median()	Returns the median of each column
# df.std()	Returns the standard deviation of each column
# Importing Data

# pd.read_csv(filename)	From a CSV file
# pd.read_table(filename)	From a delimited text file (like TSV)
# pd.read_excel(filename)	From an Excel file
# pd.read_sql(query, connection_object)	Read from a SQL table/database
# pd.read_json(json_string)	Read from a JSON formatted string, URL or file.
# pd.read_html(url)	Parses an html URL, string or file and extracts tables to a list of dataframes
# pd.read_clipboard()	Takes the contents of your clipboard and passes it to read_table()
# pd.DataFrame(dict)	From a dict, keys for columns names, values for data as lists
# Exporting Data

# df.to_csv(filename)	Write to a CSV file
# df.to_excel(filename)	Write to an Excel file
# df.to_sql(table_name, connection_object)	Write to a SQL table
# df.to_json(filename)	Write to a file in JSON format

In [85]:
# pandas functions and methods
1.Series(sequence)=>it takes sequence like list,tuple,string,etc...
2.series_object.index()/range()=>we can also provide own index like list,index,etc
3.ndim# it tells the dimention
4.shape# it tells the rows and columns
5.dtype# it tells datatype
6.python_indexing and data_structure_indexing
7.loc  # data structure indexing(means an indexing which is provided by us to the series)
8.iloc #python indexing
9.unique# it gives the unique value
10.nunique# it gives the total no of unique elements
11.value_counts()# it gives the frequesncy of the unique elements
12.values# it converts the data_structure into n-dimentional array
13.tolist()#converting data_structure into list
14.read_csv('file_name')
15.head()# it gives the first 5 values
16.tail()# it gives the last 5 values
17.columns# it gives the column name
18.isnull()#it detects the missing values
19.sum()#
20.mean()
21.info()# it gives the whole information about the data
22.describe()#it gives the statical data
23.SibSp#
24.crosstab()#
25.min()  and max()# it provides the minimum and maximum value
26.isin()#
27.between(initial_value,final_value)
28.interval_range(start,end,frequency)
29.cut(-,-)
30.#series.info()#We can't use info() method for Series,otherwise it'll give error.

SyntaxError: invalid syntax (<ipython-input-85-b59d67f02526>, line 2)

In [86]:
For practice refer to w3resource

SyntaxError: invalid syntax (<ipython-input-86-1000b7575275>, line 1)

In [87]:
pd.__version__

'0.25.1'

In [88]:
# non-numeric data  can be converted with help of pandas
#series and dataframe

In [89]:
import pandas as pd
s1=pd.Series(['python','c','c++','java'])
s1    #non numeric thingds is object in pandas

0    python
1         c
2       c++
3      java
dtype: object

In [90]:
import pandas as pd
s1=pd.Series(['Pankaj','Jaiswal','village','Tareta'])
s1

0     Pankaj
1    Jaiswal
2    village
3     Tareta
dtype: object

In [91]:
s2=pd.Series(['python','c','c++','java'])
s2.index=['a','b','c','d'] # to give the index by own
tup=(1,2,3,4,5)
s3=pd.Series(['name','pankaj','jaiswal','district','basti'],index=tup)
s2,s3

(a    python
 b         c
 c       c++
 d      java
 dtype: object, 1        name
 2      pankaj
 3     jaiswal
 4    district
 5       basti
 dtype: object)

In [92]:
import pandas as pd
s1=pd.Series(['Pankaj','Jaiswal','Village','Tareta'])
s1.index=['a:','b','c','d']
s1

a:     Pankaj
b     Jaiswal
c     Village
d      Tareta
dtype: object

In [93]:
s1=pd.Series(['python','c','c++','java'],range(10,6,-1))
print(s1)
print(s1.index)# it tells the indices of the elements
print()
s2=pd.Series(['hello','how','are','you'],range(1,5))
print(s2)

10    python
9          c
8        c++
7       java
dtype: object
RangeIndex(start=10, stop=6, step=-1)

1    hello
2      how
3      are
4      you
dtype: object

In [94]:
s1.index
s3.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [95]:
s2.index

RangeIndex(start=1, stop=5, step=1)

In [96]:
s2.ndim# its a 1-d

1

In [97]:
s3.ndim

1

In [98]:
s2.shape

(4,)

In [99]:
s2.dtype#object type is 'o'

dtype('O')

In [100]:
s2

1    hello
2      how
3      are
4      you
dtype: object

In [101]:
print(s2[1])# python indexing
print(s2[4])

hello
you

In [102]:
s3=pd.Series(['python','c','c++','java'],range(1,5))
s3

1    python
2         c
3       c++
4      java
dtype: object

In [103]:
print(s3[1])# data structure
#print(s3[0])#python index error it will give error

python

# loc and iloc

In [104]:
s3

1    python
2         c
3       c++
4      java
dtype: object

In [105]:
print(s3.loc[1])# data structure
print(s3.iloc[0])#python index

python
python

In [106]:
print(s2)
print(s2.iloc[-1])

1    hello
2      how
3      are
4      you
dtype: object
you

In [107]:
print(s3.iloc[-1])# to use python indexing you have to use iloc
# for data structure you have to use loc

java

# SLICING

In [108]:
print(s3)

1    python
2         c
3       c++
4      java
dtype: object

In [109]:
print(s3.iloc[1:3])# generally we should use iloc i.e python indexing not loc
# iloc is more and more familiar

2      c
3    c++
dtype: object

In [110]:
print(s3.iloc[::-1])# reverse the series

4      java
3       c++
2         c
1    python
dtype: object

In [111]:
print(s3.iloc[[2,3]])# accessing multiple elements in unordered manner

3     c++
4    java
dtype: object

In [112]:
# acces multipe elements unordered manner
print(s3.loc[[2,4]])# if we already know the index of the element then 
# we should use loc

2       c
4    java
dtype: object

In [113]:
# Unique elements
s3.unique

<bound method Series.unique of 1    python
2         c
3       c++
4      java
dtype: object>

In [114]:
s3.nunique()# Total no. of unique elements

4

In [115]:
#count frequency of unique elements
s3.value_counts()# Returns count in decreasing order

java      1
c++       1
c         1
python    1
dtype: int64

# convert data structure into array

In [116]:
x=s3.values# converting data structures into array
print(x)
print(type(s3))
print(type(s3.values))

['python' 'c' 'c++' 'java']
<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>

# convert data structure into list

In [117]:
s3.tolist()# converting data structures into list
s1.tolist()

['python', 'c', 'c++', 'java']

# After Exam ''20th, January 2020''

In [118]:
import pandas as pd
import numpy as np

In [119]:
df=pd.read_csv('/home/pankaj/Dataset2/Titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [120]:
df.head(3)#starting three

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [121]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [122]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [123]:
df.columns# for columns name

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [124]:
df.shape

(891, 12)

In [125]:
s3

1    python
2         c
3       c++
4      java
dtype: object

In [126]:
df.isnull().sum()# it detect missing values in the given series object. It return a 
                 # boolean same-sized object indicating if the values are NA. Missing 
                 # values gets mapped to True and non-missing value gets mapped to False.

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [127]:
# importing pandas as pd 
import pandas as pd 

# Creating the Series 
sr = pd.Series([10, 25, 3, 25, 24, 6]) 

# Create the Index 
index_ = ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew', 'ThumbsUp'] 

# set the index 
sr.index = index_ 

# Print the series 
print(sr)

Coca Cola    10
Sprite       25
Coke          3
Fanta        25
Dew          24
ThumbsUp      6
dtype: int64

In [128]:
# detect missing values 
result = sr.isnull() 

# Print the result 
print(result)

Coca Cola    False
Sprite       False
Coke         False
Fanta        False
Dew          False
ThumbsUp     False
dtype: bool

In [129]:
df.isnull().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Gender         0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [130]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Gender         891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [131]:
df.describe()#stastical data

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [132]:
# The value_counts() function is used to get a Series containing counts of unique values
# The resulting object will be in descending order so that the first element is the most 
# frequently-occurring element. 
                                    
                    #Excludes NA values by default.Dec 7, 2019

In [133]:
df.SibSp.value_counts()#SibSp means no. of siblings/spouses

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [134]:
df.Gender.values

array(['male', 'female', 'female', 'female', 'male', 'male', 'male',
       'male', 'female', 'female', 'female', 'female', 'male', 'male',
       'female', 'female', 'male', 'male', 'female', 'female', 'male',
       'male', 'female', 'male', 'female', 'female', 'male', 'male',
       'female', 'male', 'male', 'female', 'female', 'male', 'male',
       'male', 'male', 'male', 'female', 'female', 'female', 'female',
       'male', 'female', 'female', 'male', 'male', 'female', 'male',
       'female', 'male', 'male', 'female', 'female', 'male', 'male',
       'female', 'male', 'female', 'male', 'male', 'female', 'male',
       'male', 'male', 'male', 'female', 'male', 'female', 'male', 'male',
       'female', 'male', 'male', 'male', 'male', 'male', 'male', 'male',
       'female', 'male', 'male', 'female', 'male', 'female', 'female',
       'male', 'male', 'female', 'male', 'male', 'male', 'male', 'male',
       'male', 'male', 'male', 'male', 'female', 'male', 'female', 'male',
       'male', 'male', 'male', 'male', 'female', 'male', 'male', 'female',
       'male', 'female', 'male', 'female', 'female', 'male', 'male',
       'male', 'male', 'female', 'male', 'male', 'male', 'female', 'male',
       'male', 'male', 'male', 'female', 'male', 'male', 'male', 'female',
       'female', 'male', 'male', 'female', 'male', 'male', 'male',
       'female', 'female', 'female', 'male', 'male', 'male', 'male',
       'female', 'male', 'male', 'male', 'female', 'male', 'male', 'male',
       'male', 'female', 'male', 'male', 'male', 'male', 'female', 'male',
       'male', 'male', 'male', 'female', 'female', 'male', 'male', 'male',
       'male', 'female', 'male', 'male', 'male', 'male', 'female', 'male',
       'male', 'female', 'male', 'male', 'male', 'female', 'male',
       'female', 'male', 'male', 'male', 'female', 'male', 'female',
       'male', 'female', 'female', 'male', 'male', 'female', 'female',
       'male', 'male', 'male', 'male', 'male', 'female', 'male', 'male',
       'female', 'male', 'male', 'female', 'male', 'male', 'male',
       'female', 'female', 'male', 'female', 'male', 'male', 'male',
       'male', 'male', 'male', 'male', 'male', 'male', 'male', 'female',
       'female', 'male', 'male', 'female', 'male', 'female', 'male',
       'female', 'male', 'male', 'female', 'female', 'male', 'male',
       'male', 'male', 'female', 'female', 'male', 'male', 'male',
       'female', 'male', 'male', 'female', 'female', 'female', 'female',
       'female', 'female', 'male', 'male', 'male', 'male', 'female',
       'male', 'male', 'male', 'female', 'female', 'male', 'male',
       'female', 'male', 'female', 'female', 'female', 'male', 'male',
       'female', 'male', 'male', 'male', 'male', 'male', 'male', 'male',
       'male', 'male', 'female', 'female', 'female', 'male', 'female',
       'male', 'male', 'male', 'female', 'male', 'female', 'female',
       'male', 'male', 'female', 'male', 'male', 'female', 'female',
       'male', 'female', 'female', 'female', 'female', 'male', 'male',
       'female', 'female', 'male', 'female', 'female', 'male', 'male',
       'female', 'female', 'male', 'female', 'male', 'female', 'female',
       'female', 'female', 'male', 'male', 'male', 'female', 'male',
       'male', 'female', 'male', 'male', 'male', 'female', 'male', 'male',
       'male', 'female', 'female', 'female', 'male', 'male', 'male',
       'male', 'male', 'male', 'male', 'male', 'female', 'female',
       'female', 'female', 'male', 'male', 'female', 'male', 'male',
       'male', 'female', 'female', 'female', 'female', 'male', 'male',
       'male', 'male', 'female', 'female', 'female', 'male', 'male',
       'male', 'female', 'female', 'male', 'female', 'male', 'male',
       'male', 'female', 'male', 'female', 'male', 'male', 'male',
       'female', 'female', 'male', 'female', 'male', 'male', 'female',
       'male', 'male', 'female', 'male', 'female', 'male', 'male', 'male',
       'male', 'female', 'male', 'male', 'female', 'male', 'male',
       'female', 'female', 'female', 'male', 'female', 'male', 'male',
       'male', 'female', 'male', 'male', 'female', 'female', 'male',
       'male', 'male', 'female', 'female', 'male', 'male', 'female',
       'female', 'female', 'male', 'male', 'female', 'male', 'male',
       'female', 'male', 'male', 'female', 'male', 'female', 'male',
       'male', 'male', 'male', 'male', 'male', 'male', 'male', 'female',
       'female', 'male', 'male', 'male', 'male', 'male', 'male', 'male',
       'male', 'male', 'male', 'female', 'male', 'male', 'female',
       'female', 'female', 'male', 'male', 'male', 'male', 'female',
       'male', 'male', 'male', 'female', 'male', 'female', 'female',
       'male', 'male', 'male', 'male', 'male', 'male', 'male', 'male',
       'male', 'female', 'male', 'female', 'male', 'male', 'female',
       'female', 'female', 'female', 'male', 'female', 'male', 'male',
       'male', 'male', 'male', 'male', 'female', 'male', 'male', 'female',
       'male', 'female', 'male', 'female', 'male', 'male', 'female',
       'male', 'male', 'female', 'male', 'male', 'male', 'female', 'male',
       'male', 'female', 'female', 'female', 'male', 'female', 'male',
       'female', 'female', 'female', 'female', 'male', 'male', 'male',
       'female', 'male', 'male', 'male', 'male', 'male', 'male', 'male',
       'female', 'male', 'female', 'male', 'female', 'female', 'male',
       'male', 'male', 'male', 'female', 'male', 'male', 'female', 'male',
       'male', 'male', 'female', 'male', 'female', 'male', 'male',
       'female', 'female', 'female', 'male', 'female', 'female', 'male',
       'male', 'male', 'female', 'male', 'male', 'male', 'male', 'male',
       'female', 'male', 'female', 'male', 'male', 'female', 'male',
       'male', 'male', 'female', 'male', 'male', 'male', 'male', 'male',
       'male', 'male', 'female', 'female', 'female', 'male', 'female',
       'male', 'male', 'female', 'male', 'female', 'female', 'male',
       'male', 'male', 'male', 'male', 'male', 'male', 'male', 'female',
       'male', 'male', 'male', 'male', 'male', 'male', 'female', 'female',
       'male', 'male', 'female', 'male', 'male', 'female', 'female',
       'male', 'female', 'male', 'male', 'male', 'male', 'female', 'male',
       'female', 'male', 'female', 'female', 'male', 'male', 'female',
       'male', 'male', 'male', 'male', 'male', 'male', 'male', 'male',
       'male', 'male', 'male', 'female', 'female', 'male', 'male', 'male',
       'male', 'male', 'male', 'female', 'female', 'male', 'female',
       'male', 'male', 'male', 'male', 'male', 'male', 'male', 'male',
       'female', 'male', 'female', 'male', 'male', 'male', 'male', 'male',
       'female', 'male', 'male', 'female', 'male', 'female', 'male',
       'male', 'male', 'female', 'male', 'female', 'male', 'female',
       'male', 'male', 'male', 'male', 'male', 'female', 'female', 'male',
       'male', 'female', 'male', 'male', 'male', 'male', 'male', 'female',
       'female', 'male', 'female', 'female', 'male', 'male', 'male',
       'male', 'male', 'female', 'male', 'male', 'male', 'male', 'male',
       'female', 'male', 'male', 'male', 'male', 'female', 'male', 'male',
       'female', 'male', 'male', 'male', 'female', 'male', 'male', 'male',
       'male', 'female', 'male', 'male', 'male', 'female', 'male',
       'female', 'male', 'female', 'male', 'male', 'male', 'male',
       'female', 'male', 'female', 'male', 'male', 'female', 'male',
       'female', 'female', 'female', 'male', 'male', 'male', 'male',
       'female', 'male', 'male', 'male', 'male', 'male', 'female', 'male',
       'male', 'male', 'female', 'female', 'male', 'female', 'male',
       'female', 'male', 'male', 'male', 'male', 'male', 'female', 'male',
       'female', 'male', 'male', 'male', 'female', 'male', 'male',
       'female', 'male', 'male', 'male', 'female', 'male', 'male',
       'female', 'male', 'male', 'male', 'male', 'male', 'female',
       'female', 'male', 'male', 'male', 'male', 'female', 'male', 'male',
       'male', 'male', 'male', 'male', 'female', 'male', 'male', 'male',
       'male', 'male', 'male', 'female', 'male', 'male', 'female',
       'female', 'female', 'female', 'female', 'male', 'female', 'male',
       'male', 'male', 'female', 'female', 'male', 'female', 'female',
       'male', 'male', 'male', 'male', 'female', 'male', 'male', 'female',
       'female', 'male', 'male', 'male', 'female', 'female', 'male',
       'female', 'male', 'male', 'female', 'male', 'female', 'female',
       'male', 'male'], dtype=object)

In [135]:
df.Gender.value_counts()

male      577
female    314
Name: Gender, dtype: int64

In [136]:
# The above value_counts() works like this,according to me
# This code is written by me.
count=0
for i in df.Gender.values:
    if i=='male':
        count+=1
print(f'male = {count}')
print(f'female = {len(df.Gender.values)-count}' )

male = 577
female = 314

In [137]:
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [138]:
gen_sur=pd.crosstab(index=df['Gender'],columns=df['Survived'])
gen_sur# categorical data means category

Survived    0    1
Gender
female     81  233
male      468  109

In [142]:
gen_sur=pd.crosstab(index=[df['Gender'],df['Pclass']],columns=df['Survived'])
gen_sur# categorical data means category

Survived         0   1
Gender Pclass
female 1         3  91
       2         6  70
       3        72  72
male   1        77  45
       2        91  17
       3       300  47

In [143]:
df.Age.min(),df.Age.max()

(0.42, 80.0)

In [167]:
df[(df.Age>=20) & (df.Age<=30)].shape[0]

245

In [168]:
df[df.Age.isin(range(20,31))].shape[0]

240

In [176]:
df[df.Age.between(20,30)].shape[0]

245

In [182]:
age_interval=pd.interval_range(start=0,end=80,freq=10)
age_interval

IntervalIndex([(0, 10], (10, 20], (20, 30], (30, 40], (40, 50], (50, 60], (60, 70], (70, 80]],
              closed='right',
              dtype='interval[int64]')

In [189]:
df['Age_Group']=pd.cut(df['Age'],bins=age_interval)
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"(20, 30]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"(30, 40]"
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"(20, 30]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,"(30, 40]"
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,"(30, 40]"

In [200]:
df['Age_Group'].value_counts()

(20, 30]    230
(30, 40]    155
(10, 20]    115
(40, 50]     86
(0, 10]      64
(50, 60]     42
(60, 70]     17
(70, 80]      5
Name: Age_Group, dtype: int64

In [197]:
df[['Age_Group','Name']]

        Age_Group                                               Name
0    (20.0, 30.0]                            Braund, Mr. Owen Harris
1    (30.0, 40.0]  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    (20.0, 30.0]                             Heikkinen, Miss. Laina
3    (30.0, 40.0]       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4    (30.0, 40.0]                           Allen, Mr. William Henry
..            ...                                                ...
886  (20.0, 30.0]                              Montvila, Rev. Juozas
887  (10.0, 20.0]                       Graham, Miss. Margaret Edith
888           NaN           Johnston, Miss. Catherine Helen "Carrie"
889  (20.0, 30.0]                              Behr, Mr. Karl Howell
890  (30.0, 40.0]                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [ ]:
pd.crosstab(index=df['Pclass'],columns=df['Age_Group'])

# 21/01/2020

In [207]:
df.groupby('Pclass')

In [210]:
def impute_age(cols):
    Age-cols[0]
    Pclass=cols[1]
    if pd.isnull(Age):
        if Pclass==1:
            return 38
        elif Pclass==2:
            return 30
        else :
            return 25
    else:
        return Age

In [233]:
# df['Ages']=df[['Age','Pclass']].apply(impute_age,axis=1)

In [216]:
df['Fare'].min(),df['Fare'].max()

(0.0, 512.3292)

In [247]:
fare_interval=pd.interval_range(start=0,end=513,freq=50)
df['Fare_gr']=pd.cut(df['Fare'],bins=fare_interval)
df.head()

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_Group,fare_group,Fare_gr
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,"(20, 30]","(5, 10]","(0, 50]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,"(30, 40]","(70, 75]","(50, 100]"
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,"(20, 30]","(5, 10]","(0, 50]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,"(30, 40]","(50, 55]","(50, 100]"
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,"(30, 40]","(5, 10]","(0, 50]"

In [250]:
df['Fare_gr'].value_counts()

(0, 50]       716
(50, 100]     107
(100, 150]     24
(200, 250]     11
(150, 200]      9
(250, 300]      6
(450, 500]      0
(400, 450]      0
(350, 400]      0
(300, 350]      0
Name: Fare_gr, dtype: int64

In [265]:
# df.drop(['Name','Ticket','Cabin','Fare_gr','Age_Group'],axis=1)# It cuts element provided

# 19th,January 2020 , Harshit Vashisht

In [ ]:
#kaggle.com and data.world for datasets

In [4]:
# command to open the zip file==>unzip filename

# Reading csv files using pandas

In [5]:
import pandas as pd
movies_data=pd.read_csv('/home/pankaj/Downloads/tmdb-movie-metadata/tmdb_5000_credits.csv')
movies_data

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."
3,49026,The Dark Knight Rises,"[{""cast_id"": 2, ""character"": ""Bruce Wayne / Ba...","[{""credit_id"": ""52fe4781c3a36847f81398c3"", ""de..."
4,49529,John Carter,"[{""cast_id"": 5, ""character"": ""John Carter"", ""c...","[{""credit_id"": ""52fe479ac3a36847f813eaa3"", ""de..."
...,...,...,...,...
4798,9367,El Mariachi,"[{""cast_id"": 1, ""character"": ""El Mariachi"", ""c...","[{""credit_id"": ""52fe44eec3a36847f80b280b"", ""de..."
4799,72766,Newlyweds,"[{""cast_id"": 1, ""character"": ""Buzzy"", ""credit_...","[{""credit_id"": ""52fe487dc3a368484e0fb013"", ""de..."
4800,231617,"Signed, Sealed, Delivered","[{""cast_id"": 8, ""character"": ""Oliver O\u2019To...","[{""credit_id"": ""52fe4df3c3a36847f8275ecf"", ""de..."
4801,126186,Shanghai Calling,"[{""cast_id"": 3, ""character"": ""Sam"", ""credit_id...","[{""credit_id"": ""52fe4ad9c3a368484e16a36b"", ""de..."
4802,25975,My Date with Drew,"[{""cast_id"": 3, ""character"": ""Herself"", ""credi...","[{""credit_id"": ""58ce021b9251415a390165d9"", ""de..."

In [6]:
type(movies_data)#DataFrame

pandas.core.frame.DataFrame

In [7]:
movies_data.shape

(4803, 4)

In [8]:
movies_data.columns#It gives the all columns of the datashets

Index(['movie_id', 'title', 'cast', 'crew'], dtype='object')

In [9]:
movies_data.index#It gives the all index of the datashets

RangeIndex(start=0, stop=4803, step=1)

In [10]:
movies_data.head()# It  provides top 5 rows

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."
3,49026,The Dark Knight Rises,"[{""cast_id"": 2, ""character"": ""Bruce Wayne / Ba...","[{""credit_id"": ""52fe4781c3a36847f81398c3"", ""de..."
4,49529,John Carter,"[{""cast_id"": 5, ""character"": ""John Carter"", ""c...","[{""credit_id"": ""52fe479ac3a36847f813eaa3"", ""de..."

In [11]:
movies_data.tail()# It provides the last 5 rows

,movie_id,title,cast,crew
4798,9367,El Mariachi,"[{""cast_id"": 1, ""character"": ""El Mariachi"", ""c...","[{""credit_id"": ""52fe44eec3a36847f80b280b"", ""de..."
4799,72766,Newlyweds,"[{""cast_id"": 1, ""character"": ""Buzzy"", ""credit_...","[{""credit_id"": ""52fe487dc3a368484e0fb013"", ""de..."
4800,231617,"Signed, Sealed, Delivered","[{""cast_id"": 8, ""character"": ""Oliver O\u2019To...","[{""credit_id"": ""52fe4df3c3a36847f8275ecf"", ""de..."
4801,126186,Shanghai Calling,"[{""cast_id"": 3, ""character"": ""Sam"", ""credit_id...","[{""credit_id"": ""52fe4ad9c3a368484e16a36b"", ""de..."
4802,25975,My Date with Drew,"[{""cast_id"": 3, ""character"": ""Herself"", ""credi...","[{""credit_id"": ""58ce021b9251415a390165d9"", ""de..."

In [12]:
movies_data.head(10)# starting 10 rows

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."
1,285,Pirates of the Caribbean: At World's End,"[{""cast_id"": 4, ""character"": ""Captain Jack Spa...","[{""credit_id"": ""52fe4232c3a36847f800b579"", ""de..."
2,206647,Spectre,"[{""cast_id"": 1, ""character"": ""James Bond"", ""cr...","[{""credit_id"": ""54805967c3a36829b5002c41"", ""de..."
3,49026,The Dark Knight Rises,"[{""cast_id"": 2, ""character"": ""Bruce Wayne / Ba...","[{""credit_id"": ""52fe4781c3a36847f81398c3"", ""de..."
4,49529,John Carter,"[{""cast_id"": 5, ""character"": ""John Carter"", ""c...","[{""credit_id"": ""52fe479ac3a36847f813eaa3"", ""de..."
5,559,Spider-Man 3,"[{""cast_id"": 30, ""character"": ""Peter Parker / ...","[{""credit_id"": ""52fe4252c3a36847f80151a5"", ""de..."
6,38757,Tangled,"[{""cast_id"": 34, ""character"": ""Flynn Rider (vo...","[{""credit_id"": ""52fe46db9251416c91062101"", ""de..."
7,99861,Avengers: Age of Ultron,"[{""cast_id"": 76, ""character"": ""Tony Stark / Ir...","[{""credit_id"": ""55d5f7d4c3a3683e7e0016eb"", ""de..."
8,767,Harry Potter and the Half-Blood Prince,"[{""cast_id"": 3, ""character"": ""Harry Potter"", ""...","[{""credit_id"": ""52fe4273c3a36847f801fab1"", ""de..."
9,209112,Batman v Superman: Dawn of Justice,"[{""cast_id"": 18, ""character"": ""Bruce Wayne / B...","[{""credit_id"": ""553bf23692514135c8002886"", ""de..."

In [13]:
movies_data.tail(10)# last 10 rows

,movie_id,title,cast,crew
4793,182291,On The Downlow,"[{""cast_id"": 1, ""character"": ""Isaac"", ""credit_...","[{""credit_id"": ""548c416392514122ef00197d"", ""de..."
4794,286939,Sanctuary: Quite a Conundrum,"[{""cast_id"": 3, ""character"": ""Mimi"", ""credit_i...","[{""credit_id"": ""545f8107c3a3686cbb0041fd"", ""de..."
4795,124606,Bang,"[{""cast_id"": 2, ""character"": ""The Girl"", ""cred...","[{""credit_id"": ""52fe4ab0c3a368484e161add"", ""de..."
4796,14337,Primer,"[{""cast_id"": 1, ""character"": ""Aaron"", ""credit_...","[{""credit_id"": ""52fe45e79251416c75066791"", ""de..."
4797,67238,Cavite,[],"[{""credit_id"": ""52fe475dc3a368484e0c319f"", ""de..."
4798,9367,El Mariachi,"[{""cast_id"": 1, ""character"": ""El Mariachi"", ""c...","[{""credit_id"": ""52fe44eec3a36847f80b280b"", ""de..."
4799,72766,Newlyweds,"[{""cast_id"": 1, ""character"": ""Buzzy"", ""credit_...","[{""credit_id"": ""52fe487dc3a368484e0fb013"", ""de..."
4800,231617,"Signed, Sealed, Delivered","[{""cast_id"": 8, ""character"": ""Oliver O\u2019To...","[{""credit_id"": ""52fe4df3c3a36847f8275ecf"", ""de..."
4801,126186,Shanghai Calling,"[{""cast_id"": 3, ""character"": ""Sam"", ""credit_id...","[{""credit_id"": ""52fe4ad9c3a368484e16a36b"", ""de..."
4802,25975,My Date with Drew,"[{""cast_id"": 3, ""character"": ""Herself"", ""credi...","[{""credit_id"": ""58ce021b9251415a390165d9"", ""de..."

In [14]:
movies_data.info()
# object means string is stored in that columns i.e
#title       4803 non-null object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4803 entries, 0 to 4802
Data columns (total 4 columns):
movie_id    4803 non-null int64
title       4803 non-null object
cast        4803 non-null object
crew        4803 non-null object
dtypes: int64(1), object(3)
memory usage: 150.2+ KB

In [15]:
movies_data.describe()

            movie_id
count    4803.000000
mean    57165.484281
std     88694.614033
min         5.000000
25%      9014.500000
50%     14629.000000
75%     58610.500000
max    459488.000000

# Selecting columns

In [16]:
import pandas as pd

In [17]:
movies_csv=pd.read_csv('/home/pankaj/Downloads/tmdb-movie-metadata/tmdb_5000_movies.csv')
movies_csv.head()

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466
3,250000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 80, ""nam...",http://www.thedarkknightrises.com/,49026,"[{""id"": 849, ""name"": ""dc comics""}, {""id"": 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.312950,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-07-16,1084939099,165.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The Legend Ends,The Dark Knight Rises,7.6,9106
4,260000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://movies.disney.com/john-carter,49529,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,John Carter,"John Carter is a war-weary, former military ca...",43.926995,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-03-07,284139100,132.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"Lost in our world, found in another.",John Carter,6.1,2124

In [18]:
movies_csv['budget']

0       237000000
1       300000000
2       245000000
3       250000000
4       260000000
          ...
4798       220000
4799         9000
4800            0
4801            0
4802            0
Name: budget, Length: 4803, dtype: int64

In [19]:
#movies_csv['budget','original_title']# This will generate error
#you have to pass a list for more than 1 columns

In [20]:
movies_csv[['budget','original_title']]

         budget                            original_title
0     237000000                                    Avatar
1     300000000  Pirates of the Caribbean: At World's End
2     245000000                                   Spectre
3     250000000                     The Dark Knight Rises
4     260000000                               John Carter
...         ...                                       ...
4798     220000                               El Mariachi
4799       9000                                 Newlyweds
4800          0                 Signed, Sealed, Delivered
4801          0                          Shanghai Calling
4802          0                         My Date with Drew

[4803 rows x 2 columns]

In [21]:
type(movies_csv['budget'])# series==columns

pandas.core.series.Series

In [22]:
type(movies_csv[['budget']])# Now it becomes DataFrame

pandas.core.frame.DataFrame

In [23]:
movies_csv['budget']#Series

0       237000000
1       300000000
2       245000000
3       250000000
4       260000000
          ...
4798       220000
4799         9000
4800            0
4801            0
4802            0
Name: budget, Length: 4803, dtype: int64

In [24]:
movies_csv[['budget']]#DataFrame

         budget
0     237000000
1     300000000
2     245000000
3     250000000
4     260000000
...         ...
4798     220000
4799       9000
4800          0
4801          0
4802          0

[4803 rows x 1 columns]

In [25]:
movies_csv[['original_title','original_language','vote_count','runtime']]

,original_title,original_language,vote_count,runtime
0,Avatar,en,11800,162.0
1,Pirates of the Caribbean: At World's End,en,4500,169.0
2,Spectre,en,4466,148.0
3,The Dark Knight Rises,en,9106,165.0
4,John Carter,en,2124,132.0
...,...,...,...,...
4798,El Mariachi,es,238,81.0
4799,Newlyweds,en,5,85.0
4800,"Signed, Sealed, Delivered",en,6,120.0
4801,Shanghai Calling,en,7,98.0
4802,My Date with Drew,en,16,90.0

In [26]:
movies_csv[['original_title','original_language','runtime']].head()

                             original_title original_language  runtime
0                                    Avatar                en    162.0
1  Pirates of the Caribbean: At World's End                en    169.0
2                                   Spectre                en    148.0
3                     The Dark Knight Rises                en    165.0
4                               John Carter                en    132.0

# Columns selection

In [27]:
# for row selection ,simply we use python indexing
movies_csv[:1]

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800

# iloc(location based indexing)

In [28]:
movies_csv.iloc[0]

budget                                                          237000000
genres                  [{"id": 28, "name": "Action"}, {"id": 12, "nam...
homepage                                      http://www.avatarmovie.com/
id                                                                  19995
keywords                [{"id": 1463, "name": "culture clash"}, {"id":...
original_language                                                      en
original_title                                                     Avatar
overview                In the 22nd century, a paraplegic Marine is di...
popularity                                                        150.438
production_companies    [{"name": "Ingenious Film Partners", "id": 289...
production_countries    [{"iso_3166_1": "US", "name": "United States o...
release_date                                                   2009-12-10
revenue                                                        2787965087
runtime                                                               162
spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
status                                                           Released
tagline                                       Enter the World of Pandora.
title                                                              Avatar
vote_average                                                          7.2
vote_count                                                          11800
Name: 0, dtype: object

In [29]:
type(movies_csv.iloc[0])

pandas.core.series.Series

In [30]:
movies_csv.iloc[:5]#Series

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466
3,250000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 80, ""nam...",http://www.thedarkknightrises.com/,49026,"[{""id"": 849, ""name"": ""dc comics""}, {""id"": 853,...",en,The Dark Knight Rises,Following the death of District Attorney Harve...,112.312950,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-07-16,1084939099,165.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The Legend Ends,The Dark Knight Rises,7.6,9106
4,260000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://movies.disney.com/john-carter,49529,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,John Carter,"John Carter is a war-weary, former military ca...",43.926995,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-03-07,284139100,132.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"Lost in our world, found in another.",John Carter,6.1,2124

In [31]:
type(movies_csv.iloc[:5])#DataFrame

pandas.core.frame.DataFrame

In [32]:
movies_csv.iloc[[0,5,10,15]]

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
5,258000000,"[{""id"": 14, ""name"": ""Fantasy""}, {""id"": 28, ""na...",http://www.sonypictures.com/movies/spider-man3/,559,"[{""id"": 851, ""name"": ""dual identity""}, {""id"": ...",en,Spider-Man 3,The seemingly invincible Spider-Man goes up ag...,115.699814,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-01,890871626,139.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,The battle within.,Spider-Man 3,5.9,3576
10,270000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://www.superman.com,1452,"[{""id"": 83, ""name"": ""saving the world""}, {""id""...",en,Superman Returns,Superman returns to discover his 5-year absenc...,57.925623,"[{""name"": ""DC Comics"", ""id"": 429}, {""name"": ""L...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2006-06-28,391081192,154.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,NaN,Superman Returns,5.4,1400
15,225000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 10751...",NaN,2454,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,The Chronicles of Narnia: Prince Caspian,One year after their incredible adventures in ...,53.978602,"[{""name"": ""Walt Disney"", ""id"": 5888}, {""name"":...","[{""iso_3166_1"": ""CZ"", ""name"": ""Czech Republic""...",2008-05-15,419651413,150.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,Hope has a new face.,The Chronicles of Narnia: Prince Caspian,6.3,1630

In [33]:
movies_csv.iloc[[0,5,10,15],:7]#accessing rows and column simultaneously

,budget,genres,homepage,id,keywords,original_language,original_title
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar
5,258000000,"[{""id"": 14, ""name"": ""Fantasy""}, {""id"": 28, ""na...",http://www.sonypictures.com/movies/spider-man3/,559,"[{""id"": 851, ""name"": ""dual identity""}, {""id"": ...",en,Spider-Man 3
10,270000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://www.superman.com,1452,"[{""id"": 83, ""name"": ""saving the world""}, {""id""...",en,Superman Returns
15,225000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 10751...",NaN,2454,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,The Chronicles of Narnia: Prince Caspian

In [34]:
movies_csv.iloc[[0,5,10,15],[6,0,2]]#accessing rows and column simultaneously

,original_title,budget,homepage
0,Avatar,237000000,http://www.avatarmovie.com/
5,Spider-Man 3,258000000,http://www.sonypictures.com/movies/spider-man3/
10,Superman Returns,270000000,http://www.superman.com
15,The Chronicles of Narnia: Prince Caspian,225000000,NaN

# Loc

In [35]:
movies_csv.head(3)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
2,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,Spectre,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466

In [36]:
movies_csv.loc[0]

budget                                                          237000000
genres                  [{"id": 28, "name": "Action"}, {"id": 12, "nam...
homepage                                      http://www.avatarmovie.com/
id                                                                  19995
keywords                [{"id": 1463, "name": "culture clash"}, {"id":...
original_language                                                      en
original_title                                                     Avatar
overview                In the 22nd century, a paraplegic Marine is di...
popularity                                                        150.438
production_companies    [{"name": "Ingenious Film Partners", "id": 289...
production_countries    [{"iso_3166_1": "US", "name": "United States o...
release_date                                                   2009-12-10
revenue                                                        2787965087
runtime                                                               162
spoken_languages        [{"iso_639_1": "en", "name": "English"}, {"iso...
status                                                           Released
tagline                                       Enter the World of Pandora.
title                                                              Avatar
vote_average                                                          7.2
vote_count                                                          11800
Name: 0, dtype: object

In [37]:
movies_csv.loc[0:1]#here 1 is included <-------------------------------------------

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
1,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500

In [38]:
movies_data=pd.read_csv('/home/pankaj/Downloads/tmdb-movie-metadata/tmdb_5000_movies.csv'
                      ,index_col='original_title')
movies_data.head(5)

,budget,genres,homepage,id,keywords,original_language,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
original_title,,,,,,,,,,,,,,,,,,,
Avatar,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800
Pirates of the Caribbean: At World's End,300000000,"[{""id"": 12, ""name"": ""Adventure""}, {""id"": 14, ""...",http://disney.go.com/disneypictures/pirates/,285,"[{""id"": 270, ""name"": ""ocean""}, {""id"": 726, ""na...",en,"Captain Barbossa, long believed to be dead, ha...",139.082615,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2007-05-19,961000000,169.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"At the end of the world, the adventure begins.",Pirates of the Caribbean: At World's End,6.9,4500
Spectre,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466
The Dark Knight Rises,250000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 80, ""nam...",http://www.thedarkknightrises.com/,49026,"[{""id"": 849, ""name"": ""dc comics""}, {""id"": 853,...",en,Following the death of District Attorney Harve...,112.312950,"[{""name"": ""Legendary Pictures"", ""id"": 923}, {""...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-07-16,1084939099,165.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,The Legend Ends,The Dark Knight Rises,7.6,9106
John Carter,260000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://movies.disney.com/john-carter,49529,"[{""id"": 818, ""name"": ""based on novel""}, {""id"":...",en,"John Carter is a war-weary, former military ca...",43.926995,"[{""name"": ""Walt Disney Pictures"", ""id"": 2}]","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2012-03-07,284139100,132.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}]",Released,"Lost in our world, found in another.",John Carter,6.1,2124

In [39]:
# movies_data.loc['Spectre']

In [40]:
movies_data.loc[['Spectre','Avatar']]

,budget,genres,homepage,id,keywords,original_language,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
original_title,,,,,,,,,,,,,,,,,,,
Spectre,245000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.sonypictures.com/movies/spectre/,206647,"[{""id"": 470, ""name"": ""spy""}, {""id"": 818, ""name...",en,A cryptic message from Bond’s past sends him o...,107.376788,"[{""name"": ""Columbia Pictures"", ""id"": 5}, {""nam...","[{""iso_3166_1"": ""GB"", ""name"": ""United Kingdom""...",2015-10-26,880674609,148.0,"[{""iso_639_1"": ""fr"", ""name"": ""Fran\u00e7ais""},...",Released,A Plan No One Escapes,Spectre,6.3,4466
Avatar,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800

In [41]:
movies_data.loc[['Spectre','Avatar'],['budget','original_language','release_date','vote_average']]

                   budget original_language release_date  vote_average
original_title
Spectre         245000000                en   2015-10-26           6.3
Avatar          237000000                en   2009-12-10           7.2

In [42]:
# Problem
happiness_data=pd.read_csv('/home/pankaj/Downloads/world-happiness/2019.csv')
happiness_data.head(5)

,Overall rank,Country or region,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298

In [43]:
import numpy as np
GDP=happiness_data['GDP per capita']
x=happiness_data.shape
country,gdp=[],[]
country=list(range(x[0]))
gdp=np.linspace(1,GDP)
print(gdp)

[[1.         1.         1.         ... 1.         1.         1.        ]
 [1.00693878 1.00781633 1.00995918 ... 0.98673469 0.98012245 0.98583673]
 [1.01387755 1.01563265 1.01991837 ... 0.97346939 0.9602449  0.97167347]
 ...
 [1.32612245 1.36736735 1.46808163 ... 0.37653061 0.0657551  0.33432653]
 [1.33306122 1.37518367 1.47804082 ... 0.36326531 0.04587755 0.32016327]
 [1.34       1.383      1.488      ... 0.35       0.026      0.306     ]]

In [44]:
import matplotlib.pyplot as plt
plt.scatter(country,GDP)
plt.plot(country,GDP)
plt.xlabel('COUNTRY')
plt.ylabel('GDP')
plt.show()

In [45]:
#1.Find top 5 happiest countries
happiness_data.head(5)

,Overall rank,Country or region,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298

In [46]:
#2.Find least 5  happiest countries.
happiness_data.tail(5)

,Overall rank,Country or region,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
151,152,Rwanda,3.334,0.359,0.711,0.614,0.555,0.217,0.411
152,153,Tanzania,3.231,0.476,0.885,0.499,0.417,0.276,0.147
153,154,Afghanistan,3.203,0.350,0.517,0.361,0.000,0.158,0.025
154,155,Central African Republic,3.083,0.026,0.000,0.105,0.225,0.235,0.035
155,156,South Sudan,2.853,0.306,0.575,0.295,0.010,0.202,0.091

In [47]:
#3.Print all the columns names
x=happiness_data.columns
print(f'Total no. of column is {len(x)}')
print(x)

Total no. of column is 9
Index(['Overall rank', 'Country or region', 'Score', 'GDP per capita',
       'Social support', 'Healthy life expectancy',
       'Freedom to make life choices', 'Generosity',
       'Perceptions of corruption'],
      dtype='object')

In [48]:
#4.Print row index and meta data information
happiness_data.index,happiness_data.info

(RangeIndex(start=0, stop=156, step=1),
 <bound method DataFrame.info of      Overall rank         Country or region  Score  GDP per capita  \
 0               1                   Finland  7.769           1.340
 1               2                   Denmark  7.600           1.383
 2               3                    Norway  7.554           1.488
 3               4                   Iceland  7.494           1.380
 4               5               Netherlands  7.488           1.396
 ..            ...                       ...    ...             ...
 151           152                    Rwanda  3.334           0.359
 152           153                  Tanzania  3.231           0.476
 153           154               Afghanistan  3.203           0.350
 154           155  Central African Republic  3.083           0.026
 155           156               South Sudan  2.853           0.306

      Social support  Healthy life expectancy  Freedom to make life choices  \
 0             1.587                    0.986                         0.596
 1             1.573                    0.996                         0.592
 2             1.582                    1.028                         0.603
 3             1.624                    1.026                         0.591
 4             1.522                    0.999                         0.557
 ..              ...                      ...                           ...
 151           0.711                    0.614                         0.555
 152           0.885                    0.499                         0.417
 153           0.517                    0.361                         0.000
 154           0.000                    0.105                         0.225
 155           0.575                    0.295                         0.010

      Generosity  Perceptions of corruption
 0         0.153                      0.393
 1         0.252                      0.410
 2         0.271                      0.341
 3         0.354                      0.118
 4         0.322                      0.298
 ..          ...                        ...
 151       0.217                      0.411
 152       0.276                      0.147
 153       0.158                      0.025
 154       0.235                      0.035
 155       0.202                      0.091

 [156 rows x 9 columns]>)

In [49]:
#5.Use iloc and find the countries with happiness index from 5th to 10th.
happiness_data.iloc[5:11]

,Overall rank,Country or region,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
5,6,Switzerland,7.480,1.452,1.526,1.052,0.572,0.263,0.343
6,7,Sweden,7.343,1.387,1.487,1.009,0.574,0.267,0.373
7,8,New Zealand,7.307,1.303,1.557,1.026,0.585,0.330,0.380
8,9,Canada,7.278,1.365,1.505,1.039,0.584,0.285,0.308
9,10,Austria,7.246,1.376,1.475,1.016,0.532,0.244,0.226
10,11,Australia,7.228,1.372,1.548,1.036,0.557,0.332,0.290

In [50]:
#6.Change index_col and find the happiness rank o Japan , India and Pakistan.
happiness_data=pd.read_csv('/home/pankaj/Downloads/world-happiness/2019.csv',index_col='Country or region')
happiness_data.loc[['Japan','India','Pakistan'],'Overall rank']

Country or region
Japan        58
India       140
Pakistan     67
Name: Overall rank, dtype: int64

In [51]:
happiness_data.head(1)

,Overall rank,Score,GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption
Country or region,,,,,,,,
Finland,1,7.769,1.34,1.587,0.986,0.596,0.153,0.393

## Series in pandas

In [52]:
series=happiness_data['Overall rank']#Single column is series
type(series)

pandas.core.series.Series

In [53]:
DataFrame=happiness_data[['Overall rank','Score']]#More than one column is datafram
type(DataFrame)

pandas.core.frame.DataFrame

In [54]:
DataFrame.info()

<class 'pandas.core.frame.DataFrame'>
Index: 156 entries, Finland to South Sudan
Data columns (total 2 columns):
Overall rank    156 non-null int64
Score           156 non-null float64
dtypes: float64(1), int64(1)
memory usage: 8.7+ KB

In [55]:
#series.info()#We can't use info() method for Series,otherwise it'll give error

In [56]:
series=movies_data['runtime']
series

original_title
Avatar                                      162.0
Pirates of the Caribbean: At World's End    169.0
Spectre                                     148.0
The Dark Knight Rises                       165.0
John Carter                                 132.0
                                            ...
El Mariachi                                  81.0
Newlyweds                                    85.0
Signed, Sealed, Delivered                   120.0
Shanghai Calling                             98.0
My Date with Drew                            90.0
Name: runtime, Length: 4803, dtype: float64

In [57]:
series.sum()# It sums the total value of series,means total of runti me

513111.0

In [58]:
series.size# it also counts the missing values

4803

In [59]:
series.count()#It only counts the non-zero values

4801

In [60]:
# Total no. of missing values 
series.size-series.count()

2

In [61]:
series.isnull().sum()# Total no. of missing values like above method

2

In [62]:
series.mean()#It counts the mean of whole series

106.87585919600083

In [63]:
series.std()# It counts

22.611934588844207

In [64]:
series.median()# It gives the median

103.0

In [65]:
series.min()# It gives the minimum value out of series

0.0

In [66]:
series.max()# It gives the maximum value out of the series

338.0

In [67]:
series.unique()# It gives the unique values,it only works for Series not for DataFrame

array([162., 169., 148., 165., 132., 139., 100., 141., 153., 151., 154.,
       106., 149., 143., 150., 136., 144., 140., 161., 113., 187., 194.,
       147., 131., 124., 127., 130., 108., 104., 142., 125., 114., 103.,
       115., 137., 116., 122.,  93.,  98.,  91., 158.,  96., 109., 152.,
        94., 126., 112., 123., 135., 118.,  97., 119., 102., 120., 121.,
       166.,  99., 183., 175., 138., 157.,  92., 101., 111.,  89., 105.,
       107., 129.,  88.,  85., 163., 133.,  95.,  90., 110., 128., 156.,
       117., 146.,  82.,  78., 134., 170.,  76., 178.,  84., 155., 145.,
       180., 172., 167., 201., 179.,  83.,  87.,  80.,  74.,  81., 177.,
        86., 164., 159., 191., 189., 214.,   0.,  75., 192., 160., 219.,
       248., 188., 202., 173., 195.,  77.,  79.,  63., 229., 193., 254.,
        72.,  68., 199., 181., 242., 338.,  73., 216., 276.,  nan, 200.,
        69., 197., 184., 176., 185., 171., 174.,  46.,  53.,  42., 240.,
        41.,  67., 238., 186.,  70.,  14., 225., 207.,  66.,  59.,  25.,
        47.,  64.,  60.])

In [68]:
series.unique()# It gives the total no. of unique values including missing(nan) values

array([162., 169., 148., 165., 132., 139., 100., 141., 153., 151., 154.,
       106., 149., 143., 150., 136., 144., 140., 161., 113., 187., 194.,
       147., 131., 124., 127., 130., 108., 104., 142., 125., 114., 103.,
       115., 137., 116., 122.,  93.,  98.,  91., 158.,  96., 109., 152.,
        94., 126., 112., 123., 135., 118.,  97., 119., 102., 120., 121.,
       166.,  99., 183., 175., 138., 157.,  92., 101., 111.,  89., 105.,
       107., 129.,  88.,  85., 163., 133.,  95.,  90., 110., 128., 156.,
       117., 146.,  82.,  78., 134., 170.,  76., 178.,  84., 155., 145.,
       180., 172., 167., 201., 179.,  83.,  87.,  80.,  74.,  81., 177.,
        86., 164., 159., 191., 189., 214.,   0.,  75., 192., 160., 219.,
       248., 188., 202., 173., 195.,  77.,  79.,  63., 229., 193., 254.,
        72.,  68., 199., 181., 242., 338.,  73., 216., 276.,  nan, 200.,
        69., 197., 184., 176., 185., 171., 174.,  46.,  53.,  42., 240.,
        41.,  67., 238., 186.,  70.,  14., 225., 207.,  66.,  59.,  25.,
        47.,  64.,  60.])

In [69]:
series.nunique(dropna=False)# dropna  is the missing values,it works for DataFrame
                            # as well as Series

157

In [70]:
series.nunique(dropna=True)

156

In [71]:
series.nunique()# It gives the total no. of unique values excluding missing values

156

In [72]:
series.value_counts()#It counts the frequency of an interval

90.0     163
100.0    149
98.0     140
97.0     133
95.0     123
        ...
338.0      1
53.0       1
214.0      1
194.0      1
179.0      1
Name: runtime, Length: 156, dtype: int64

In [73]:
series.value_counts(ascending=True)

179.0      1
194.0      1
214.0      1
53.0       1
338.0      1
        ...
95.0     123
97.0     133
98.0     140
100.0    149
90.0     163
Name: runtime, Length: 156, dtype: int64


## How to create own Series  without DataFrame

In [74]:
#You can create Series with any kind of sequence,ex-> list,tuple,dictionary,numpy-array
anime=['My Hero Academia','Death note','Sword Art Online','One Punch Man',
       'Domestic Girlfriend',]
genre=['Shounen','Shounen','Action Adventure','Action',
      'Sports/Josei']
series=pd.Series(anime)#Making of Series
series

0       My Hero Academia
1             Death note
2       Sword Art Online
3          One Punch Man
4    Domestic Girlfriend
dtype: object

In [75]:
type(series)

pandas.core.series.Series

In [76]:
series=pd.Series(anime,name='Animation Movies')#Making of Series with names
series

0       My Hero Academia
1             Death note
2       Sword Art Online
3          One Punch Man
4    Domestic Girlfriend
Name: Animation Movies, dtype: object

In [77]:
import pandas as pd
series=pd.Series(genre,index=genre,name='Pankaj Jaiswal')

In [78]:
series

Shounen                      Shounen
Shounen                      Shounen
Action Adventure    Action Adventure
Action                        Action
Sports/Josei            Sports/Josei
Name: Pankaj Jaiswal, dtype: object

In [79]:
anime=['My Hero Academia','Death note','Sword Art Online','One Punch Man',
       'Domestic Girlfriend',]
import numpy as np
x=np.array(anime)
series=pd.Series(genre,index=anime)# Creating Series with the numpy array
series

My Hero Academia                Shounen
Death note                      Shounen
Sword Art Online       Action Adventure
One Punch Man                    Action
Domestic Girlfriend        Sports/Josei
dtype: object

In [80]:
dic={       'My Hero Academia'   :            'Shounen',
            'Death note      '    :            'Shounen',
            'Sword Art Online'    :   'Action Adventure',
            'One Punch Man   '    :             'Action',
            'Domestic Girlfriend' :       'Sports/Josei'
}
series=pd.Series(dic,name='Dictionary Series')
series

My Hero Academia                Shounen
Death note                      Shounen
Sword Art Online       Action Adventure
One Punch Man                    Action
Domestic Girlfriend        Sports/Josei
Name: Dictionary Series, dtype: object

In [81]:
movies_data=pd.read_csv('/home/pankaj/Downloads/tmdb-movie-metadata/tmdb_5000_movies.csv',
                       usecols=['runtime'],squeeze=True)
movies_data

0       162.0
1       169.0
2       148.0
3       165.0
4       132.0
        ...
4798     81.0
4799     85.0
4800    120.0
4801     98.0
4802     90.0
Name: runtime, Length: 4803, dtype: float64

In [83]:
type(movies_data)

pandas.core.series.Series